{
    "name": "Yi Sun-shin",
    "type": "Marksman",
    "story": "The City of the Dragon is located in the northeast Cadia Riverlands, connecting the Frozen Sea and the Sea of Hope. It is the only passage for all ships sailing from the Northern Vale to Cadia Riverlands and further south. The geological advantage allowed the city to develop foreign trade business, making it a prosperous harbor and a booming city.But this bustling city never had one day of peace ever since its establishment. Pirates from the Frozen Sea and the Sea of Hope had been invading this city, raiding the harbor and plundering the merchant ships. After years of battle against the pirates, the people of the city built a mighty navy, the Paenlong Fleet, to fight back the pirates and protect their homeland and trading routes.From this naval fleet, came the legendary hero - Yi Sun-shin. Born and raised in the City of the Dragon, Yi Sun-shin grew up witnessing countless tragedies happening around him, ships raided and fishers murdered in cold blood by the pirates. And so, the young Yi Sun-shin made up his mind to become an admiral and protect his homeland.Yi Sun-shin spent his entire childhood training and preparing himself for the future. He learned the techniques of sailing and fighting. He even ventured to the Dragons Altar and acquired knowledge from the elders there.At the age of 18, Yi Sun-shin finally joined the naval fleet, though he was just a sailor at the time. In the next decade, Yi Sun-shin followed the fleet to numerous battles, traveling between the Frozen Sea and the Sea of Hope and fighting the notorious pirates. He showed unprecedented wisdom and leadership in the fights, and gradually became the head of the entire Paenlong Fleet after years of battles.Under the command of Yi Sun-shin, the legendary fleet defeated the pirates time and time again, driving almost all the pirates back into the Sea of Hope and restoring peace to this once devastated place.As Yi Sun-shin kept launching assaults, the pirate started to feel desperate. The desperation that they couldn't win against Yi Sun-shin had also made one thing more clear, if they still wanted to get back to the City of the Dragon, they had to take Yi Sun-shin down. Knowing that they couldn’t take Yi Sun-shin and his fleet head-on and defeat him on the sea, they resorted to trickery. Dressed in disguise, the buccaneers infiltrated the City of the Dragon and spread rumors, claiming that Yi Sun-shin wasn’t content with leading just the naval fleet but wanted to rule the entire City of the Dragon and the Sea of Hope instead after achieving something this extraordinary.Exactly as expected by the pirate, the rulers of the city took the gossips as accusations, and rumors as truths. In no time, they then dismissed Yi Sun-shin from his duty and made him a commoner. Seeing this, the treacherous pirates moved on to their next part of the plan. They spread another rumor saying that pirates were assembling at the Frozen Sea, which was a chance to hunt them down once and for all.Despite how strongly Yi Sun-shin was advising against it, the rulers took the bait and sent most of the Paenlong Fleet to this mission, leaving only a few vessels behind to protect the harbor. But what they did not know was that the pirates of the Frozen Sea and the Sea of Hope had joined forces and set up a trap at the northern part of Frozen Sea, waiting for the fleet to fall right into it.The battle was a massacre. Without Yi Sun-shin to lead, the rudderless navy was no match for the pirates, many veterans died and most of the battleships sank. Flanked by the coalition of pirates, the once legendary navy was nearly wiped out.Soon after this event, the victorious coalition of pirates sailed to the City of the Dragon, threatening to leave this place in ruins. Without a navy to protect them, the people of the city were frightened. Many civilians considered abandoning the homeland they built, some even suggested that the city gave all their properties to the pirates in exchange for their lives.It was at this desperate moment that Yi Sun-shin stood up for his people once again. He made a speech, restoring hope and morale to those who tried to run away or surrender. He mobilized the civilians and armed them just in time, and formed another fleet consisting of fishing boats and a few battleships.When the coalition of pirates was at their doorstep, Yi Sun-shin led this new fleet to confront them, making a stand in this final fight, knowing he would sacrifice for the greater good. Yi Sun-shin commanded his own ship to charge ahead and lead the way despite heavy artillery fire from the pirate ships. Encouraged by Yi Sun-shin’s heroic action, the brave men of Paenlong sailed forward and miraculously won the battle in an extremely outnumbered situation. The coalition of pirates consisting of more than two hundred battleships was defeated by twelve vessels.The pirates of the two sea areas were devastated in this battle and were incapable of invading the City of the Dragon for the next couple of years. As for Yi Sun-shin, he rebuilt the Paenlong Fleet for the City of the Dragon and kept watching over the sea.",
    "status": {
        "durability": "70",
        "offense": "80",
        "ability_effect": "60",
        "difficulty": "80"
    },
    "skills": {
        "passive": {
            "name": "Heavenly Vow",
            "icon": "./hero/Yi Sun-shin/img/skills/passive_heavenly_vow.png",
            "desc": "",
            "tips": "If possible always use your Glaive (Sword) to attack, the damage output from it is higher<br>Every 3 minutes a Turtleship will appear at the base, head over to collect it<br>Turtleship gives a movement speed buff and turns your “1” into a straight line skillshot that stuns the enemy when hit.<br>Has an innate slow passive, best used for chasing enemies or slowing them down when running, try to hit them as much as possible."
        },
        "first_skill": {
            "name": "Traceless",
            "icon": "./hero/Yi Sun-shin/img/skills/first_skill_traceless.png",
            "desc": "Yi Sun-shin slashes forward with his glaive, dealing 150/180/210/240/270/300 Physical Damage. He becomes immune to CC while dashing and gains 30%/30%/30%/30%/30%/30% Damage Reduction for 1/1/1/1/1/1s.",
            "tips": "Your ESCAPE tool, use it wisely<br>Decent slow, for escaping or chasing<br>Turtleship would replace this skill so take note, You’ll be flying back like a normal “1” however there will be a straight line skillshot to stun the enemy."
        },
        "second_skill": {
            "name": "Blood Floods",
            "icon": "./hero/Yi Sun-shin/img/skills/second_skill_blood_floods.png",
            "desc": "",
            "tips": "Your main harassing skill.<br>One of the hardest hitting skill<br>Range and damage increases when you charge your attack, make sure you have it charged fully for maximum damage<br>Movement while charging is possible, however it’s a little slow"
        },
        "ultimate": {
            "name": "Mountain Shocker",
            "icon": "./hero/Yi Sun-shin/img/skills/ultimate_mountain_shocker.png",
            "desc": "",
            "tips": "That being said, it’s not impossible to avoid this ult, try to save this when your team is engaging in a team fight or you need to know the location of your enemies.<br>Please don’t use this immediately once it’s off CD, it has one of the longest CD in the game and the mana consumption is crazy<br>When playing with friends, you can let your friend tell you when a teamfight is about to start or is happening for you to deal more residual damage. If SoloQ-ing, please keep an eye on the minimap to know when a fight is starting."
        }
    }
}